[
  {
    "title": "The Future of Intelligent Systems: Where We're Headed and Why It Matters",
    "date": "2025-05-08",
    "slug": "future-of-intelligent-systems",
    "categories": ["tech", "ai", "innovation"],
    "excerpt": "A thoughtful exploration of where AI, cloud, and architecture are going—and how organizations can prepare for the next wave of intelligent systems."
  },
  {
    "title": "Building AI-Ready Architectures on Azure",
    "date": "2025-04-18",
    "slug": "building-ai-ready-architectures",
    "categories": ["cloud", "ai", "azure"],
    "excerpt": "A comprehensive guide to preparing enterprise systems for AI integration using Microsoft Azure's cloud platform and services."
  },
  {
    "title": "From Monolith to Microservices: Lessons from the Trenches",
    "date": "2025-03-12",
    "slug": "monolith-to-microservices",
    "categories": ["tech", "architecture"],
    "excerpt": "Real-world insights from modernizing legacy systems and the trade-offs involved when breaking down monolithic applications into microservices."
  },
  {
    "title": "Leading Tech Teams Through Change: What I've Learned",
    "date": "2025-02-26",
    "slug": "leading-tech-teams-through-change",
    "categories": ["leadership", "management"],
    "excerpt": "Reflections on managing teams through digital transformation and uncertainty, with practical advice for tech leaders facing similar challenges."
  },
  {
    "title": "From Idea to Impact: Rapid Prototyping with Azure OpenAI and Copilot Studio",
    "date": "2025-01-15",
    "slug": "rapid-prototyping-azure-openai",
    "categories": ["azure", "ai", "development"],
    "excerpt": "A practical walkthrough showing how to turn concepts into working solutions quickly using Azure's AI services."
  },
  {
    "title": "Architect as a Translator: Bridging Business and Engineering",
    "date": "2024-12-10",
    "slug": "architect-as-translator",
    "categories": ["architecture", "leadership"],
    "excerpt": "How effective software architects turn business needs into technical solutions—and why that translation role is critical for organizational success."
  },
  {
    "title": "Embracing the BBS Aesthetic in Modern Web Design",
    "date": "2025-05-13",
    "slug": "bbs-aesthetic",
    "categories": ["design", "nostalgia"],
    "excerpt": "Bulletin Board Systems (BBS) were the precursors to the modern internet. The distinctive aesthetic of these early digital spaces has seen a resurgence in popularity among designers seeking to evoke digital nostalgia while maintaining modern usability."
  }
]
